; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	spectrograph2 - mode
	infrared3 - mode
	image4 - mode
	image6 - mode
	image1 - mode
	infrared0 - mode
	image5 - mode
	Star7 - direction
	Star9 - direction
	GroundStation5 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Star8 - direction
	GroundStation1 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	Star6 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
	Planet13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 image5)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 infrared3)
	(supports instrument1 infrared0)
	(supports instrument1 image4)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
	(supports instrument2 image1)
	(supports instrument2 infrared3)
	(supports instrument2 image6)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 Star8)
	(supports instrument3 infrared3)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
)
(:goal (and
	(pointing satellite0 GroundStation1)
	(have_image Star10 spectrograph2)
	(have_image Star11 infrared0)
	(have_image Star12 spectrograph2)
	(have_image Star12 image6)
	(have_image Planet13 image5)
	(have_image Planet13 image4)
	(have_image Star14 spectrograph2)
	(have_image Star14 image4)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 9
2. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 0 of 9
3. (turn_to satellite0 star14 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star14)
   goals met: 0 of 9
4. (take_image satellite0 star14 instrument1 image4)
   added: (have_image star14 image4)
   goals met: 1 of 9
5. (turn_to satellite0 star11 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star11)
   goals met: 1 of 9
6. (take_image satellite0 star11 instrument1 infrared0)
   added: (have_image star11 infrared0)
   goals met: 2 of 9
7. (turn_to satellite0 planet13 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 planet13)
   goals met: 2 of 9
8. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 9
9. (calibrate satellite1 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 2 of 9
10. (take_image satellite0 planet13 instrument1 image4)
   added: (have_image planet13 image4)
   goals met: 3 of 9
11. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 3 of 9
12. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 9
13. (turn_to satellite0 groundstation4 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 groundstation4)
   goals met: 3 of 9
14. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 3 of 9
15. (turn_to satellite0 planet13 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 planet13)
   goals met: 3 of 9
16. (take_image satellite0 planet13 instrument0 image5)
   added: (have_image planet13 image5)
   goals met: 4 of 9
17. (turn_to satellite0 star10 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star10)
   goals met: 4 of 9
18. (take_image satellite0 star10 instrument0 spectrograph2)
   added: (have_image star10 spectrograph2)
   goals met: 5 of 9
19. (turn_to satellite0 star12 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star12)
   goals met: 5 of 9
20. (take_image satellite0 star12 instrument0 spectrograph2)
   added: (have_image star12 spectrograph2)
   goals met: 6 of 9
21. (turn_to satellite0 star14 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star14)
   goals met: 6 of 9
22. (take_image satellite0 star14 instrument0 spectrograph2)
   added: (have_image star14 spectrograph2)
   goals met: 7 of 9
23. (turn_to satellite0 groundstation1 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 groundstation1)
   goals met: 8 of 9
24. (turn_to satellite1 star12 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star12)
   goals met: 8 of 9
25. (take_image satellite1 star12 instrument2 image6)
   added: (have_image star12 image6)
   goals met: 9 of 9
